In [1]:
# imports
import pandas as pd
import matplotlib.pyplot

In [2]:
anonymized_data = pd.read_csv('../data/anonymized_shuffled_phase2.csv')
public_data = pd.read_excel('../data/public_data_register_phase2.xlsx')

In [3]:
!pip3 install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in /home/gregkoncz/.local/lib/python3.8/site-packages (1.2.0)

In [4]:
public_data.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1
1,"el-Asmar, Hasan",Male,1995-02-18,2100,Denmark,Never married,1
2,"Widaa, Cameron",Male,1996-08-24,2300,Denmark,Never married,1
3,"Santos, Jose",Male,2000-05-16,2300,Denmark,Never married,1
4,"Buczynski, Elizabeth",Female,1999-06-03,2300,Denmark,Never married,1

In [5]:
anonymized_data.head()

,sex,evote,age,zip,education,citizenship,party
0,Male,1,30.768506,2400,Vocational Education and Training (VET),Denmark,Green
1,Female,0,47.177024,2400,Vocational Education and Training (VET),Denmark,Green
2,Female,1,46.697183,2400,Vocational bachelors educations,Denmark,Red
3,Female,0,41.181924,2300,Primary education,Denmark,Green
4,Female,0,57.105226,2200,Vocational Education and Training (VET),Not danish,Green

In [6]:
anonymized_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sex          200 non-null    object
 1   evote        200 non-null    int64
 2   age          200 non-null    float64
 3   zip          200 non-null    int64
 4   education    200 non-null    object
 5   citizenship  200 non-null    object
 6   party        200 non-null    object
dtypes: float64(1), int64(2), object(4)
memory usage: 11.1+ KB

In [7]:
public_data['encoded_citizenship'] = public_data['citizenship'].apply(lambda x: 'Denmark' if x == 'Denmark' else 'Not danish')

In [8]:
public_data = public_data[public_data['last_voted'] != 2]
public_data['evote'] = public_data['last_voted']
public_data['detailed_citizenship'] = public_data['citizenship']
public_data['citizenship'] = public_data['encoded_citizenship']

## Merge stuff

In [9]:
merged_df = public_data.merge(anonymized_data, on = ['sex', 'evote', 'citizenship', 'zip'], how = 'outer')

In [10]:
merged_df.shape

(12448, 13)

In [11]:
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green

In [12]:
merged_df['calculated_age'] = merged_df['dob'].apply(lambda x: 2020 - x.year)

In [13]:
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green,24
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green,24
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red,24
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green,24
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green,24

In [14]:
import numpy as np

In [15]:
merged_df['age_diff'] = merged_df['calculated_age'] - merged_df['age']
merged_df['age_diff'] = merged_df['age_diff'].apply(np.abs)
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green,24,13.348805
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green,24,5.298145
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red,24,15.542624
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green,24,4.171254
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green,24,2.388973

In [16]:
merged_df = merged_df[merged_df['age_diff'] < 8]
merged_df.shape

(3623, 15)

In [46]:
merged_df[['sex', 'citizenship', 'evote', 'zip', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip']).nunique()
## I think where the count for name is one here, that should be a match

                               name
sex    citizenship evote zip
Female Denmark     0     2100    51
                         2200    70
                         2300    87
                         2400   120
                   1     2100    21
                         2200    38
                         2300    37
                         2400    33
       Not danish  0     2100     2
                         2200     4
                         2300     3
                         2400    11
                   1     2200     1
                         2400     1
Male   Denmark     0     2100    37
                         2200    69
                         2300    62
                         2400    97
                   1     2100    25
                         2200    20
                         2300    34
                         2400    45
       Not danish  0     2200     4
                         2400     7
                   1     2100     1
                         2400     5

## Searching out and finding rare combinations

In [18]:
female_merged = merged_df[merged_df["sex"] == 'Female']
male_merged = merged_df[merged_df["sex"] == 'Male']

In [37]:
female_evote = female_merged[female_merged['evote'] == 1]
female_evote = female_evote[female_evote['marital_status'] != 'Widowed'] # based on aux
female_paper = female_merged[female_merged['evote'] == 0]
male_evote = male_merged[male_merged['evote'] == 1]
male_evote = male_evote[male_evote['marital_status'] != 'Widowed'] # based on aux
male_paper = male_merged[male_merged['evote'] == 0]

In [38]:
male_evote.shape

(439, 15)

In [39]:
female_evote_danish = female_evote[female_evote['citizenship'] == 'Denmark']
female_evote_nondanish = female_evote[female_evote['citizenship'] != 'Denmark']
female_paper_danish = female_paper[female_paper['citizenship'] == 'Denmark']
female_paper_nondanish = female_paper[female_paper['citizenship'] != 'Denmark']
male_evote_danish = male_evote[male_evote['citizenship'] == 'Denmark']
male_evote_nondanish = male_evote[male_evote['citizenship'] != 'Denmark']
male_paper_danish = male_paper[male_paper['citizenship'] == 'Denmark']
male_paper_nondanish = male_paper[male_paper['citizenship'] != 'Denmark']

In [40]:
female_evote_nondanish

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2575,"Fang, Christina",Female,1992-12-01,2400,Not danish,Never married,1,Not danish,1,"Congo, Democratic Republic",26.979729,Vocational bachelors educations,Green,28,1.020271
2578,"Lovan, Adinidiin",Female,1984-07-20,2200,Not danish,Never married,1,Not danish,1,Stateless,34.075781,Short cycle higher education,Green,36,1.924219

In [24]:
female_paper_nondanish[female_paper_nondanish['zip'] == 2100] ## cant decide

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
9760,"al-Baddour, Nawwaara",Female,1999-08-07,2100,Not danish,Never married,0,Not danish,0,Sweden,18.137659,Upper secondary education,Green,21,2.862341
9761,"Stafford, Mariah",Female,1997-10-20,2100,Not danish,Never married,0,Not danish,0,Romania,18.137659,Upper secondary education,Green,23,4.862341

In [25]:
female_evote_nondanish[female_evote_nondanish['zip'] == 2200] ## match

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2578,"Lovan, Adinidiin",Female,1984-07-20,2200,Not danish,Never married,1,Not danish,1,Stateless,34.075781,Short cycle higher education,Green,36,1.924219

In [26]:
female_evote_nondanish[female_evote_nondanish['zip'] == 2400] ## match 2

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2575,"Fang, Christina",Female,1992-12-01,2400,Not danish,Never married,1,Not danish,1,"Congo, Democratic Republic",26.979729,Vocational bachelors educations,Green,28,1.020271

In [41]:
male_evote_nondanish[male_evote_nondanish['zip'] == 2100] ## match 3

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2581,"Hamilton, Bryce",Male,1957-06-16,2100,Not danish,Never married,1,Not danish,1,Germany,58.101356,Vocational Education and Training (VET),Red,63,4.898644

In [44]:
male_evote_nondanish ## only Paudel matches .

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2561,"Paudel, Jijo",Male,1976-07-07,2400,Not danish,Married/separated,1,Not danish,1,Afghanistan,42.744010,Masters programmes,Green,44,1.255990
2562,"Plummer, Edgar",Male,1966-12-23,2400,Not danish,Divorced,1,Not danish,1,Nepal,53.809517,Vocational Education and Training (VET),Green,54,0.190483
2564,"Chang, Kevin",Male,1964-08-03,2400,Not danish,Married/separated,1,Not danish,1,Somalia,53.809517,Vocational Education and Training (VET),Green,56,2.190483
2566,"Enriquez, Marcus",Male,1965-08-13,2400,Not danish,Divorced,1,Not danish,1,Netherlands,53.809517,Vocational Education and Training (VET),Green,55,1.190483
2568,"De La Rosa, Felipe",Male,1959-09-16,2400,Not danish,Never married,1,Not danish,1,Eritrea,53.809517,Vocational Education and Training (VET),Green,61,7.190483
2581,"Hamilton, Bryce",Male,1957-06-16,2100,Not danish,Never married,1,Not danish,1,Germany,58.101356,Vocational Education and Training (VET),Red,63,4.898644

In [48]:
female_evote[['sex', 'citizenship', 'evote', 'zip', 'age', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip', 'age']).nunique()

                                         name
sex    citizenship evote zip  age
Female Denmark     1     2100 23.260386    11
                              24.276624    12
                              26.725296    13
                              47.432241     7
                              48.431793     7
                              77.751844     1
                         2200 24.612206    13
                              28.769921    14
                              30.581843    15
                              30.717271    15
                              31.107778    15
                              37.599490    12
                              38.621897    11
                              44.282284    11
                              53.805837    11
                              75.230199     7
                         2300 20.942843     9
                              22.102592    11
                              23.215098    13
                              28.795302    21
                              34.051761    21
                              39.431709    18
                              40.199983    18
                              41.871451    16
                              48.965601    10
                         2400 37.048394    14
                              38.273006    16
                              43.191165    16
                              46.261110    17
                              46.697183    17
                              47.100830    18
                              51.857893    13
                              53.498671    12
                              64.804004    10
       Not danish  1     2200 34.075781     1
                         2400 26.979729     1

In [49]:
female_evote_danish[female_evote_danish['zip']==2100]

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2035,"Perry, Leslie",Female,1999-03-01,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,21,2.260386
2037,"Perry, Leslie",Female,1999-03-01,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,21,5.725296
2038,"Perry, Leslie",Female,1999-03-01,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,21,3.276624
2041,"Tomlinson, Leslie",Female,1999-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,21,2.260386
2043,"Tomlinson, Leslie",Female,1999-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,21,5.725296
2044,"Tomlinson, Leslie",Female,1999-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,21,3.276624
2047,"Dunston, Samantha",Female,2000-02-22,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,20,3.260386
2049,"Dunston, Samantha",Female,2000-02-22,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,20,6.725296
2050,"Dunston, Samantha",Female,2000-02-22,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,20,4.276624
2053,"Yoshimura, Elise",Female,1995-07-02,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,25,1.739614
2055,"Yoshimura, Elise",Female,1995-07-02,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,25,1.725296
2056,"Yoshimura, Elise",Female,1995-07-02,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,25,0.723376
2059,"Mcdade, Keleshia",Female,1991-05-08,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,29,5.739614
2061,"Mcdade, Keleshia",Female,1991-05-08,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,29,2.274704
2062,"Mcdade, Keleshia",Female,1991-05-08,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,29,4.723376
2065,"el-Salaam, Hakeema",Female,1993-09-05,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,27,3.739614
2067,"el-Salaam, Hakeema",Female,1993-09-05,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,27,0.274704
2068,"el-Salaam, Hakeema",Female,1993-09-05,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,27,2.723376
2073,"Kiefer, Auriel",Female,1988-02-18,2100,Denmark,Divorced,1,Denmark,1,Denmark,26.725296,Not stated,Green,32,5.274704
2074,"Kiefer, Auriel",Female,1988-02-18,2100,Denmark,Divorced,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,32,7.723376
2077,"Truong, Crystal",Female,1990-05-06,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,30,6.739614
2079,"Truong, Crystal",Female,1990-05-06,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,30,3.274704
2080,"Truong, Crystal",Female,1990-05-06,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,30,5.723376
2085,"Vinnola, Leslie",Female,1986-11-28,2100,Denmark,Divorced,1,Denmark,1,Denmark,26.725296,Not stated,Green,34,7.274704
2089,"el-Basha, Muna",Female,1993-07-07,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,27,3.739614
2091,"el-Basha, Muna",Female,1993-07-07,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,27,0.274704
2092,"el-Basha, Muna",Female,1993-07-07,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,27,2.723376
2095,"Munoz, Valeria",Female,1989-08-11,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,31,7.739614
2097,"Munoz, Valeria",Female,1989-08-11,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,31,4.274704
2098,"Munoz, Valeria",Female,1989-08-11,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,31,6.723376
2101,"Ho, Tina",Female,1992-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,28,4.739614
2103,"Ho, Tina",Female,1992-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,28,1.274704
2104,"Ho, Tina",Female,1992-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,28,3.723376
2107,"Chapman, Carlee",Female,1991-01-02,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,29,5.739614
2109,"Chapman, Carlee",Female,1991-01-02,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,29,2.274704
2110,"Chapman, Carlee",Female,1991-01-02,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,29,4.723376
2126,"Lawrence, Morgan",Female,1977-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,43,5.431793
2129,"Lawrence, Morgan",Female,1977-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,43,4.432241
2132,"Warwick, Tianna",Female,1976-01-14,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,44,4.431793
2135,"Warwick, Tianna",Female,1976-01-14,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,44,3.432241
2150,"Strom, Hannah",Female,1979-11-18,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,41,7.431793
2153,"Strom, Hannah",Female,1979-11-18,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,41,6.432241
2156,"el-Assad, Nameera",Female,1979-08-21,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,41,7.431793
2159,"el-Assad, Nameera",Female,1979-08-21,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,41,6.432241
2162,"Cartwright, Paige",Female,1972-05-04,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,48,0.431793
2165,"Cartwright, Paige",Female,1972-05-04,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,48,0.567759
2168,"Hayes-Joshua, Jemeeka",Female,1970-08-23,2100,Denmark,Divorced,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,50,1.568207
2171,"Hayes-Joshua, Jemeeka",Female,1970-08-23,2100,Denmark,Divorced,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,50,2.567759
2174,"Peterson, Morgan",Female,1970-11-26,2100,Denmark,Never married,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,50,1.568207
2177,"Peterson, Morgan",Female,1970-11-26,2100,Denmark,Never married,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,50,2.567759
2202,"Sayers, Aquasia",Female,1943-07-30,2100,Denmark,Divorced,1,Denmark,1,Denmark,77.751844,Vocational bachelors educations,Red,77,0.751844

In [50]:
male_evote[['sex', 'citizenship', 'evote', 'zip', 'age', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip', 'age']).nunique()

                                       name
sex  citizenship evote zip  age
Male Denmark     1     2100 26.083445    16
                            26.106013    16
                            28.802569    16
                            29.269073    18
                            30.357140    17
                            32.361569    18
                            37.814819    10
                            41.984883     6
                            54.001253     3
                            59.893174     3
                       2200 21.611027     9
                            28.171254    13
                            29.298145    12
                            37.348805    10
                            38.450169    11
                            39.542624    10
                       2300 20.080954     7
                            38.353330     7
                            46.486765    16
                            50.062405    15
                            52.462269    18
                            52.762678    18
                            58.129052    15
                            58.966695    15
                       2400 30.768506    11
                            44.039302    16
                            44.846198    16
                            51.677135    18
                            52.120187    18
                            53.690564    18
                            55.162699    19
                            65.956483    10
                            68.771132     8
     Not danish  1     2100 58.101356     1
                       2400 42.744010     1
                            53.809517     4

In [51]:
male_evote_nondanish[male_evote_nondanish['zip'] == 2400]

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
2561,"Paudel, Jijo",Male,1976-07-07,2400,Not danish,Married/separated,1,Not danish,1,Afghanistan,42.744010,Masters programmes,Green,44,1.255990
2562,"Plummer, Edgar",Male,1966-12-23,2400,Not danish,Divorced,1,Not danish,1,Nepal,53.809517,Vocational Education and Training (VET),Green,54,0.190483
2564,"Chang, Kevin",Male,1964-08-03,2400,Not danish,Married/separated,1,Not danish,1,Somalia,53.809517,Vocational Education and Training (VET),Green,56,2.190483
2566,"Enriquez, Marcus",Male,1965-08-13,2400,Not danish,Divorced,1,Not danish,1,Netherlands,53.809517,Vocational Education and Training (VET),Green,55,1.190483
2568,"De La Rosa, Felipe",Male,1959-09-16,2400,Not danish,Never married,1,Not danish,1,Eritrea,53.809517,Vocational Education and Training (VET),Green,61,7.190483